snlkuharlocal/src/Documents/ДопДанныеГТДкМашине/ДопДанныеГТДкМашине.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДопДанныеГТДкМашине</name>
  <basedOn>Document.Машина</basedOn>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеГТД</name>
    <attributes>
      <name>ГТД</name>
      <type>
        <types>CatalogRef.ГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>ТНВЭД</name>
      <type>
        <types>CatalogRef.ТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаможеннаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоБезУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормативУтилизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЭкологическогоСбора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеГТДУпаковки</name>
    <attributes>
      <name>ГТД</name>
      <type>
        <types>CatalogRef.ГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>ТНВЭД</name>
      <type>
        <types>CatalogRef.ТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ТНВЭДНоменклатуры</name>
      <type>
        <types>CatalogRef.ТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаможеннаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоБезУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормативУтилизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЭкологическогоСбора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ТНВЭД/ТНВЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТНВЭД</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АнглоязычноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботыСМаркировкой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбязательнойРаботыСМаркировкой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСимволовВКарточку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРазмера</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативУтилизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЭкологическогоСбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КлассификаторыДляМаркировки</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользовать</name>
      <comment>Не использовать</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ДопДанныеГТДкМашине/ManagerModule.bsl
#Область ЗагрузкаИзXML

// Возвращает Таблицу значений из загруженного файла
Функция ЗагрузитьИзФайлаXMLНаСервере(ДокОбъект, АдресВременногоХранилища, Расширение) Экспорт
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(Поток,,,);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);	
	ЧтениеXML.Закрыть();
	
	Разыменователь = Новый РазыменовательПространствИменDOM(ДокументDOM);
	
	ПервыйПараметрПроверки = ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("REGNUM",ДокументDOM,Разыменователь));
	ВторойПараметрПроверки = ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("G_16_1",ДокументDOM,Разыменователь));
	
	Если ПервыйПараметрПроверки <> Неопределено И ВторойПараметрПроверки <> Неопределено Тогда 
		Возврат ПервыйТипXML(ДокОбъект, ДокументDOM,Разыменователь);	
	Иначе 
		ПервыйПараметрПроверки = ДокументDOM.ПолучитьЭлементыПоИмени("cat_ru:PrDocumentNumber");
		ВторойПараметрПроверки = ДокументDOM.ПолучитьЭлементыПоИмени("RUScat_ru:CounryName");
		
		Если ПервыйПараметрПроверки.Количество() > 0 и ВторойПараметрПроверки.Количество() > 0 Тогда 
			Возврат ВторойТипXML(ДокОбъект, ДокументDOM,Разыменователь);			
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗначениеУзлаXPath(РезультатXPath, ТипРезультата = Неопределено)
	Если РезультатXPath <> Неопределено Тогда
		Узел = РезультатXPath.ПолучитьСледующий();
		Если Узел <> Неопределено Тогда
			ТекстУзла = Узел.ТекстовоеСодержимое;
			Если ТипРезультата = Неопределено Тогда
				Возврат ТекстУзла;
			Иначе
				Возврат XMLЗначение(ТипРезультата,ТекстУзла);		
			КонецЕсли;		
		КонецЕсли;		
	КонецЕсли; 
	
	Возврат Неопределено;
КонецФункции

Функция ПервыйТипXML(ДокОбъект, ДокументDOM, Разыменователь)
	
	// G_31_8 = Количество, G_33_1 = ТНВЭД, G_35_1 = Вес Брутто, G_38_1 = Вес Нетто, G_42_1 = Таможенная Стоимость
	// G_38_2 = Вес Нетто без Упаковки
	
	ДанныеГТД = Новый ТаблицаЗначений;
	ДанныеГТД.Колонки.Добавить("ГТД", Новый ОписаниеТипов("СправочникСсылка.ГТД"));
	ДанныеГТД.Колонки.Добавить("ТНВЭД", Новый ОписаниеТипов("СправочникСсылка.ТНВЭД"));
	ДанныеГТД.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ДанныеГТД.Колонки.Добавить("ТаможеннаяСтоимость", Новый ОписаниеТипов("Число"));
	ДанныеГТД.Колонки.Добавить("ВесНетто", Новый ОписаниеТипов("Число"));
	ДанныеГТД.Колонки.Добавить("ВесНеттоБезУпаковки", Новый ОписаниеТипов("Число"));
	ДанныеГТД.Колонки.Добавить("ВесБрутто", Новый ОписаниеТипов("Число"));
	ДанныеГТД.Колонки.Добавить("НормативУтилизации", Новый ОписаниеТипов("Число"));
	ДанныеГТД.Колонки.Добавить("СтавкаЭкологическогоСбора", Новый ОписаниеТипов("Число"));
	ДанныеГТД.Колонки.Добавить("Всего", Новый ОписаниеТипов("Число"));
	
	НомерГТДСтрокой = ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("REGNUM",ДокументDOM,Разыменователь));
	СтранаСтрокой = ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("G_16_1",ДокументDOM,Разыменователь));
	
	ГТД = НайтиСоздатьГТД(НомерГТДСтрокой, , СтранаСтрокой);
	
	ДанныеГТД.Очистить();	
	
	РазделыDOM = ДокументDOM.ПолучитьЭлементыПоИмени("BLOCK");
	
	Для Каждого РазделDOM Из РазделыDOM Цикл
		
		СтрокаТЧ = ДанныеГТД.Добавить();
		
		СтрокаТЧ.ГТД = ГТД;
		
		СтрокаТЧ.ТНВЭД = Справочники.ТНВЭД.НайтиПоКоду(ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("G_33_1",РазделDOM, Разыменователь)));		
		
		СтрокаТЧ.Количество = ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("G_31_8", РазделDOM, Разыменователь));
		
		СтрокаТЧ.ТаможеннаяСтоимость = ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("G_42_1", РазделDOM, Разыменователь));
		
		СтрокаТЧ.ВесНетто = ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("G_38_1", РазделDOM, Разыменователь));
		
		СтрокаТЧ.ВесНеттоБезУпаковки = ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("G_38_2", РазделDOM, Разыменователь));
		
		СтрокаТЧ.ВесБрутто = ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("G_35_1", РазделDOM, Разыменователь));
		
		СтрокаТЧ.НормативУтилизации = ПолучитьПериодическийРеквизит(СтрокаТЧ.ТНВЭД, "НормативУтилизации", КонецДня(ДокОбъект.Дата));
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НормативУтилизации) Тогда
			СтрокаТЧ.НормативУтилизации = СтрокаТЧ.ТНВЭД.НормативУтилизации;	
		КонецЕсли;
		
		СтрокаТЧ.СтавкаЭкологическогоСбора = ПолучитьПериодическийРеквизит(СтрокаТЧ.ТНВЭД, "СтавкаЭкологическогоСбора", КонецДня(ДокОбъект.Дата));
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтавкаЭкологическогоСбора) Тогда
			СтрокаТЧ.СтавкаЭкологическогоСбора = СтрокаТЧ.ТНВЭД.СтавкаЭкологическогоСбора;	
		КонецЕсли;
		
		СтрокаТЧ.Всего = СтрокаТЧ.ВесНетто * СтрокаТЧ.НормативУтилизации * СтрокаТЧ.СтавкаЭкологическогоСбора;
		
	КонецЦикла;
	
	Возврат ДанныеГТД;
	
КонецФункции

Функция ВторойТипXML(ДокОбъект, ДокументDOM, Разыменователь)
	
	// catESAD_cu:GrossWeightQuantity = Вес Брутто
	// catESAD_cu:NetWeightQuantity = Вес Нетто
	// catESAD_cu:GoodsTNVEDCode = ТНВЭД
	// catESAD_cu:GoodsQuantity = Количество
	// catESAD_cu:InvoicedCost = Таможенная Стоимость
	
	// catESAD_cu:NetWeightQuantity2 = Вес Нетто без Упаковки
	
	ДанныеГТД = Новый ТаблицаЗначений;
	ДанныеГТД.Колонки.Добавить("ГТД", Новый ОписаниеТипов("СправочникСсылка.ГТД"));
	ДанныеГТД.Колонки.Добавить("ТНВЭД", Новый ОписаниеТипов("СправочникСсылка.ТНВЭД"));
	ДанныеГТД.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ДанныеГТД.Колонки.Добавить("ТаможеннаяСтоимость", Новый ОписаниеТипов("Число"));
	ДанныеГТД.Колонки.Добавить("ВесНетто", Новый ОписаниеТипов("Число"));
	ДанныеГТД.Колонки.Добавить("ВесНеттоБезУпаковки", Новый ОписаниеТипов("Число"));
	ДанныеГТД.Колонки.Добавить("ВесБрутто", Новый ОписаниеТипов("Число"));
	ДанныеГТД.Колонки.Добавить("НормативУтилизации", Новый ОписаниеТипов("Число"));
	ДанныеГТД.Колонки.Добавить("СтавкаЭкологическогоСбора", Новый ОписаниеТипов("Число"));
	ДанныеГТД.Колонки.Добавить("Всего", Новый ОписаниеТипов("Число"));
	
	ГТД = Неопределено;
	
	Если СтрДлина(ДокументDOM.ПолучитьЭлементыПоИмени("ED_Container").Элемент(0).СледующийСоседний.ТекстовоеСодержимое)=26	Тогда
		НомерГТДСтр = Прав(ДокументDOM.ПолучитьЭлементыПоИмени("ED_Container").Элемент(0).СледующийСоседний.ТекстовоеСодержимое,23);
		СтранаШапка	= ДокументDOM.ПолучитьЭлементыПоИмени("RUScat_ru:CounryName").элемент(0).ТекстовоеСодержимое;
		ГТД	= НайтиСоздатьГТД(НомерГТДСтр,,СтранаШапка);
	КонецЕсли;
	
	ДанныеГТД.Очистить();
	
	РазделыDOM = ДокументDOM.ПолучитьЭлементыПоИмени("ESADout_CUGoods");
	
	Для Каждого РазделDOM Из РазделыDOM Цикл
		
		СтрокаТЧ = ДанныеГТД.Добавить();
		
		СтрокаТЧ.ГТД = ГТД;
		
		СтрокаТЧ.ТНВЭД = Справочники.ТНВЭД.НайтиПоКоду(ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("catESAD_cu:GoodsTNVEDCode", РазделDOM, Разыменователь)));
		
		СтрокаТЧ.ВесБрутто = ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("catESAD_cu:GrossWeightQuantity", РазделDOM, Разыменователь));
		
		СтрокаТЧ.ВесНетто = ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("catESAD_cu:NetWeightQuantity", РазделDOM, Разыменователь));
		
		СтрокаТЧ.ВесНеттоБезУпаковки = ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("catESAD_cu:NetWeightQuantity2", РазделDOM, Разыменователь));
		
		СтрокаТЧ.ТаможеннаяСтоимость = ПолучитьЗначениеУзлаXPath(ДокументDOM.ВычислитьВыражениеXPath("catESAD_cu:InvoicedCost", РазделDOM, Разыменователь));
		
		СтрокаТЧ.НормативУтилизации = ПолучитьПериодическийРеквизит(СтрокаТЧ.ТНВЭД, "НормативУтилизации", КонецДня(ДокОбъект.Дата));
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НормативУтилизации) Тогда
			СтрокаТЧ.НормативУтилизации = СтрокаТЧ.ТНВЭД.НормативУтилизации;	
		КонецЕсли;
		
		СтрокаТЧ.СтавкаЭкологическогоСбора = ПолучитьПериодическийРеквизит(СтрокаТЧ.ТНВЭД, "СтавкаЭкологическогоСбора", КонецДня(ДокОбъект.Дата));
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтавкаЭкологическогоСбора) Тогда
			СтрокаТЧ.СтавкаЭкологическогоСбора = СтрокаТЧ.ТНВЭД.СтавкаЭкологическогоСбора;	
		КонецЕсли;
		
		ТоварыDOM = РазделDOM.ПолучитьЭлементыПоИмени(РазделDOM.URIПространстваИмен,"catESAD_cu:GoodsGroupDescription");
		
		ВсегоКоличествоПоТоварам = 0;
		
		Для Каждого ТоварDOM Из ТоварыDOM Цикл	
			
			Для Каждого Товары из ТоварDOM.ДочерниеУзлы Цикл
				
				Если Товары.ИмяУзла = "catESAD_cu:GoodsGroupInformation" Тогда
					
					Для Каждого ДочернийУзелОписанияТоваров Из Товары.ДочерниеУзлы цикл
						
						Если ДочернийУзелОписанияТоваров.ИмяУзла = "catESAD_cu:GoodsGroupQuantity" Тогда	
							Для Каждого УзелКоличества из ДочернийУзелОписанияТоваров.ДочерниеУзлы Цикл
								Если  УзелКоличества.ИмяУзла = "catESAD_cu:GoodsQuantity" Тогда
									Количество = УзелКоличества.ТекстовоеСодержимое;
									ВсегоКоличествоПоТоварам = ВсегоКоличествоПоТоварам + Количество;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		СтрокаТЧ.Количество = ВсегоКоличествоПоТоварам;
		
		СтрокаТЧ.Всего = СтрокаТЧ.ВесНетто * СтрокаТЧ.НормативУтилизации * СтрокаТЧ.СтавкаЭкологическогоСбора;
		
	КонецЦикла;
	
	Возврат ДанныеГТД;
	
КонецФункции

Функция НайтиСоздатьГТД(НомерГТДСтр, НомерРаздела = Неопределено, Страна = "")
	
	Запрос=Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1 
	|	Ссылка
	|ИЗ 
	|	Справочник.ГТД 
	|ГДЕ 
	|	Наименование=&Наименование 
	|	И "+?(ЗначениеЗаполнено(НомерРаздела),"НЕ","")+" ЭтоГруппа
	|");
	
	Наименование=""+НомерГТДСтр+?(ЗначениеЗаполнено(НомерРаздела),"/"+НомерРаздела,"");
	Запрос.УстановитьПараметр("Наименование",СокрЛП(Наименование));
	
	Выборка=Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Если ЗначениеЗаполнено(НомерРаздела) Тогда
			мНомерГТД=Справочники.ГТД.СоздатьЭлемент();
			
			Если ЗначениеЗаполнено(Страна) Тогда
				мНомерГТД.СтранаПроисхождения = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(Страна);					
			КонецЕсли;
			Если мНомерГТД.СтранаПроисхождения.Пустая() Тогда
				Сообщить("Не возможно создать ГТД. Не указана или не найдена страна !",СтатусСообщения.Важное);
				Возврат Справочники.ГТД.ПустаяСсылка();			
			КонецЕсли;							
			//мНомерГТД.Родитель = НомерГТДСтр;
		Иначе			
			мНомерГТД=Справочники.ГТД.СоздатьГруппу();					
		КонецЕсли;
		
		мНомерГТД.Владелец = Справочники.ИБ.НайтиПоКоду("SSP");
		мНомерГТД.Наименование = СокрЛП(Наименование);
		мНомерГТД.Записать();
		
		Возврат мНомерГТД.Ссылка;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаИзЭксель

Функция ЗагрузитьИзФайлаЭксельНаСервере(ДокОбъект, АдресВременногоХранилища, Расширение) Экспорт
	
	ДанныеГТДУпаковки = Новый ТаблицаЗначений;
	ДанныеГТДУпаковки.Колонки.Добавить("ГТД", Новый ОписаниеТипов("СправочникСсылка.ГТД"));
	ДанныеГТДУпаковки.Колонки.Добавить("ТНВЭД", Новый ОписаниеТипов("СправочникСсылка.ТНВЭД"));
	ДанныеГТДУпаковки.Колонки.Добавить("ТНВЭДНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ТНВЭД"));
	ДанныеГТДУпаковки.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ДанныеГТДУпаковки.Колонки.Добавить("ТаможеннаяСтоимость", Новый ОписаниеТипов("Число"));
	ДанныеГТДУпаковки.Колонки.Добавить("ВесНетто", Новый ОписаниеТипов("Число"));
	ДанныеГТДУпаковки.Колонки.Добавить("ВесНеттоБезУпаковки", Новый ОписаниеТипов("Число"));
	ДанныеГТДУпаковки.Колонки.Добавить("ВесБрутто", Новый ОписаниеТипов("Число"));
	ДанныеГТДУпаковки.Колонки.Добавить("НормативУтилизации", Новый ОписаниеТипов("Число"));
	ДанныеГТДУпаковки.Колонки.Добавить("СтавкаЭкологическогоСбора", Новый ОписаниеТипов("Число"));
	ДанныеГТДУпаковки.Колонки.Добавить("Всего", Новый ОписаниеТипов("Число"));
	
	ДанныеГТДУпаковки.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка"));
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Попытка
		ТабличныйДокумент.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат ДанныеГТДУпаковки;
	КонецПопытки;
	
	/////////////////////////////////////////////////////////////////////////////////////////////
	// Сформируем ДанныеГТДУпаковки (оба Варианта)
	/////////////////////////////////////////////////////////////////////////////////////////////
	
	ПеречитатьОбласти = Ложь;  ВариантЗагрузки = 1; // "Упаковочный"
	
	Если ТабличныйДокумент.Области.Найти("Упаковочный") = Неопределено Тогда
		ВариантЗагрузки = 2;	
	КонецЕсли;
	
	Для Каждого Область Из ТабличныйДокумент.Области Цикл
		
		ЧитаемаяОбласть = ТабличныйДокумент.ПолучитьОбласть(Область.Имя);
		
		Если Область.Имя = "ПереводЛиста" Тогда  // "Перевод"
			
			НомерПервойСтроки = 21;
			НомерПервойКолонки = 1;
			
   	   		ИсточникДанных = ЧитаемаяОбласть.Область(НомерПервойСтроки, НомерПервойКолонки, ЧитаемаяОбласть.ВысотаТаблицы, ЧитаемаяОбласть.ШиринаТаблицы);
			ТЗ_Перевод = Документы.ДопДанныеГТДкМашине.ПрочитатьТабличныйДокументВТаблицуЗначений(ИсточникДанных);
			
			Для Каждого Стр ИЗ ТЗ_Перевод Цикл
				Если НЕ ПустаяСтрока(Стр["Номер_2"]) Тогда
					
					СтрокаТЧ = ДанныеГТДУпаковки.Добавить();
					
					Если ПустаяСтрока(Стр["Номер_"]) Тогда
						СтрокаТЧ.ТНВЭД = Справочники.ТНВЭД.НайтиПоКоду(СокрЛП(Стр["Номер_2"]));
						
						Если ЗначениеЗаполнено(СтрокаТЧ.ТНВЭД) Тогда
						
							Для Каждого СтрокаГТД ИЗ ДанныеГТДУпаковки Цикл
								Если НЕ ЗначениеЗаполнено(СтрокаГТД.ТНВЭД) Тогда
									СтрокаГТД.ТНВЭД = СтрокаТЧ.ТНВЭД; 
								КонецЕсли;
							КонецЦикла;
						
						КонецЕсли;
					Иначе
						СтрокаТЧ.ТНВЭДНоменклатуры = Справочники.ТНВЭД.НайтиПоКоду(СокрЛП(Стр["Номер_2"]));
					
						СтрокаТЧ.ВесБрутто = Стр["Номер_9"];
					
						СтрокаТЧ.ВесНетто = Стр["Номер_8"];
					
						СтрокаТЧ.ВесНеттоБезУпаковки = Стр["Номер_7"];
					
						СтрокаТЧ.Количество = Стр["Номер_6"];
					
						СтрокаТЧ.ТаможеннаяСтоимость = Стр["Номер_11"];
					КонецЕсли;
					
					СтрокаТЧ.НормативУтилизации = ПолучитьПериодическийРеквизит(СтрокаТЧ.ТНВЭД, "НормативУтилизации", КонецДня(ДокОбъект.Дата));
					Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НормативУтилизации) Тогда
						СтрокаТЧ.НормативУтилизации = СтрокаТЧ.ТНВЭД.НормативУтилизации;	
					КонецЕсли;
		
					СтрокаТЧ.СтавкаЭкологическогоСбора = ПолучитьПериодическийРеквизит(СтрокаТЧ.ТНВЭД, "СтавкаЭкологическогоСбора", КонецДня(ДокОбъект.Дата));
					Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтавкаЭкологическогоСбора) Тогда
						СтрокаТЧ.СтавкаЭкологическогоСбора = СтрокаТЧ.ТНВЭД.СтавкаЭкологическогоСбора;	
					КонецЕсли;
					
					СтрокаТЧ.Всего = СтрокаТЧ.ВесНетто * СтрокаТЧ.НормативУтилизации * СтрокаТЧ.СтавкаЭкологическогоСбора;
					
				КонецЕсли;
			КонецЦикла;
			
			ПеречитатьОбласти = Ложь;
			
		ИначеЕсли Область.Имя = "УпаковочныйЛист" Тогда   // "Упаковочный" - уже не надо!!!!!
			
			НомерПервойСтроки = 13;
			НомерПервойКолонки = 1;
			
   	   		ИсточникДанных = ЧитаемаяОбласть.Область(НомерПервойСтроки, НомерПервойКолонки, ЧитаемаяОбласть.ВысотаТаблицы, ЧитаемаяОбласть.ШиринаТаблицы);
			ТЗ_Упаковочный = Документы.ДопДанныеГТДкМашине.ПрочитатьТабличныйДокументВТаблицуЗначений(ИсточникДанных);
			
			Для Каждого Стр ИЗ ТЗ_Упаковочный Цикл
				Если НЕ ПустаяСтрока(Стр["Номер_1"]) Тогда
					
					СтрокаТЧ = ДанныеГТДУпаковки.Добавить();
					
					СтрокаТЧ.ВесБрутто = Стр["Номер_9"];
					
					СтрокаТЧ.ВесНетто = Стр["Номер_8"];
					
					СтрокаТЧ.ВесНеттоБезУпаковки = Стр["Номер_7"];
					
					СтрокаТЧ.Количество = Стр["Номер_5"];
					
					СтрокаТЧ.НормативУтилизации = ПолучитьПериодическийРеквизит(СтрокаТЧ.ТНВЭД, "НормативУтилизации", КонецДня(ДокОбъект.Дата));
					Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НормативУтилизации) Тогда
						СтрокаТЧ.НормативУтилизации = СтрокаТЧ.ТНВЭД.НормативУтилизации;	
					КонецЕсли;
		
					СтрокаТЧ.СтавкаЭкологическогоСбора = ПолучитьПериодическийРеквизит(СтрокаТЧ.ТНВЭД, "СтавкаЭкологическогоСбора", КонецДня(ДокОбъект.Дата));
					Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтавкаЭкологическогоСбора) Тогда
						СтрокаТЧ.СтавкаЭкологическогоСбора = СтрокаТЧ.ТНВЭД.СтавкаЭкологическогоСбора;	
					КонецЕсли;
					
					СтрокаТЧ.Всего = СтрокаТЧ.ВесНетто * СтрокаТЧ.НормативУтилизации * СтрокаТЧ.СтавкаЭкологическогоСбора;
					
				КонецЕсли;	
			КонецЦикла;
			
			Артикул = "";
			Для Каждого СтрокаГТД ИЗ ДанныеГТДУпаковки Цикл
				Если НЕ ПустаяСтрока(СтрокаГТД.Артикул) Тогда
					Артикул = СокрЛП(СтрокаГТД.Артикул);
				Иначе
					СтрокаГТД.Артикул = Артикул; 
				КонецЕсли;
			КонецЦикла;
			
			ПеречитатьОбласти = Истина;
			
		ИначеЕсли Область.Имя = "Экологический_налог" Тогда
			
			Если ВариантЗагрузки = 1 Тогда
				
				НомерПервойСтроки = 4;
				НомерПервойКолонки = 1;
				
				ИсточникДанных = ЧитаемаяОбласть.Область(НомерПервойСтроки, НомерПервойКолонки, ЧитаемаяОбласть.ВысотаТаблицы, ЧитаемаяОбласть.ШиринаТаблицы);
				ТЗ_Экологический = Документы.ДопДанныеГТДкМашине.ПрочитатьТабличныйДокументВТаблицуЗначений(ИсточникДанных);
				
				КодТНВЭД = СокрЛП(ТЗ_Экологический[0]["Номер_8"]);
				
				ТНВЭД = Справочники.ТНВЭД.НайтиПоКоду(КодТНВЭД);
				
				Для Каждого Стр ИЗ ТЗ_Экологический Цикл
					Если НЕ ПустаяСтрока(Стр["Номер_1"]) Тогда
						
						СтрокаТЧ = ДанныеГТДУпаковки.Добавить();
						
						СтрокаТЧ.ТНВЭД = ТНВЭД;
						
						СтрокаТЧ.ТНВЭДНоменклатуры = Справочники.ТНВЭД.НайтиПоКоду(СокрЛП(Стр["Номер_1"]));
						
						СтрокаТЧ.Количество = Стр["Номер_4"];
						СтрокаТЧ.ВесНетто = Стр["Номер_6"];
						СтрокаТЧ.ВесБрутто = Стр["Номер_8"];
						
						//СтрокаТЧ.ВесНеттоБезУпаковки = Стр["Номер_7"];
						
						СтрокаТЧ.НормативУтилизации = ПолучитьПериодическийРеквизит(СтрокаТЧ.ТНВЭД, "НормативУтилизации", КонецДня(ДокОбъект.Дата));
						Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НормативУтилизации) Тогда
							СтрокаТЧ.НормативУтилизации = СтрокаТЧ.ТНВЭД.НормативУтилизации;	
						КонецЕсли;
						
						СтрокаТЧ.СтавкаЭкологическогоСбора = ПолучитьПериодическийРеквизит(СтрокаТЧ.ТНВЭД, "СтавкаЭкологическогоСбора", КонецДня(ДокОбъект.Дата));
						Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтавкаЭкологическогоСбора) Тогда
							СтрокаТЧ.СтавкаЭкологическогоСбора = СтрокаТЧ.ТНВЭД.СтавкаЭкологическогоСбора;	
						КонецЕсли;
						
						СтрокаТЧ.Всего = СтрокаТЧ.ВесНетто * СтрокаТЧ.НормативУтилизации * СтрокаТЧ.СтавкаЭкологическогоСбора;
						
					КонецЕсли;	
				КонецЦикла;
				
				ПеречитатьОбласти = Ложь;
				
			ИначеЕсли ВариантЗагрузки = 2 Тогда
				
				НомерПервойСтроки = 21;
				НомерПервойКолонки = 2;
				
				ИсточникДанных = ЧитаемаяОбласть.Область(НомерПервойСтроки, НомерПервойКолонки, ЧитаемаяОбласть.ВысотаТаблицы, ЧитаемаяОбласть.ШиринаТаблицы);
				ТЗ_Экологический = Документы.ДопДанныеГТДкМашине.ПрочитатьТабличныйДокументВТаблицуЗначений(ИсточникДанных);
				
				КодТНВЭД = СокрЛП(ТЗ_Экологический[0]["Номер_12"]);
				
				ТНВЭД = Справочники.ТНВЭД.НайтиПоКоду(КодТНВЭД);
				
				Для Каждого Стр ИЗ ТЗ_Экологический Цикл
					Если НЕ ПустаяСтрока(Стр["Номер_"]) Тогда
						
						СтрокаТЧ = ДанныеГТДУпаковки.Добавить();
						
						СтрокаТЧ.ТНВЭД = ТНВЭД;
						
						СтрокаТЧ.ТНВЭДНоменклатуры = Справочники.ТНВЭД.НайтиПоКоду(СокрЛП(Стр["Номер_"]));
						
						СтрокаТЧ.Количество = ?(Стр["Номер_5"] = "/", 0, Стр["Номер_5"]);
						СтрокаТЧ.ВесНетто = ?(Стр["Номер_6"] = "/", 0, Стр["Номер_6"]);    // ???
						СтрокаТЧ.ВесБрутто = ?(Стр["Номер_12"] = "/", 0, Стр["Номер_12"]);
						
						//СтрокаТЧ.ВесНеттоБезУпаковки = Стр["Номер_7"];
						
						СтрокаТЧ.НормативУтилизации = ПолучитьПериодическийРеквизит(СтрокаТЧ.ТНВЭД, "НормативУтилизации", КонецДня(ДокОбъект.Дата));
						Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НормативУтилизации) Тогда
							СтрокаТЧ.НормативУтилизации = СтрокаТЧ.ТНВЭД.НормативУтилизации;	
						КонецЕсли;
						
						СтрокаТЧ.СтавкаЭкологическогоСбора = ПолучитьПериодическийРеквизит(СтрокаТЧ.ТНВЭД, "СтавкаЭкологическогоСбора", КонецДня(ДокОбъект.Дата));
						Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтавкаЭкологическогоСбора) Тогда
							СтрокаТЧ.СтавкаЭкологическогоСбора = СтрокаТЧ.ТНВЭД.СтавкаЭкологическогоСбора;	
						КонецЕсли;
						
						СтрокаТЧ.Всего = СтрокаТЧ.ВесНетто * СтрокаТЧ.НормативУтилизации * СтрокаТЧ.СтавкаЭкологическогоСбора;
						
					КонецЕсли;	
				КонецЦикла;
				
				ПеречитатьОбласти = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	/////////////////////////////////////////////////////////////////////////////////////////////
	// Перечитаем Области, дозаполним ДанныеГТДУпаковки
	/////////////////////////////////////////////////////////////////////////////////////////////
	
	Если ПеречитатьОбласти Тогда
		
		Для Каждого Область Из ТабличныйДокумент.Области Цикл
		
			ЧитаемаяОбласть = ТабличныйДокумент.ПолучитьОбласть(Область.Имя);
			
			Если Область.Имя = "Инвойс" Тогда
				
				НомерПервойСтроки = 13;
				НомерПервойКолонки = 1;
			
   	   			ИсточникДанных = ЧитаемаяОбласть.Область(НомерПервойСтроки, НомерПервойКолонки, ЧитаемаяОбласть.ВысотаТаблицы, ЧитаемаяОбласть.ШиринаТаблицы);
				ТЗ_Инвойс = Документы.ДопДанныеГТДкМашине.ПрочитатьТабличныйДокументВТаблицуЗначений(ИсточникДанных);
				
				Для Каждого Стр ИЗ ТЗ_Инвойс Цикл
				
					НайденныеСтроки = ДанныеГТДУпаковки.НайтиСтроки(Новый Структура("Артикул", СокрЛП(Стр["Номер_"])));
					
					Для Каждого НСтрока ИЗ НайденныеСтроки Цикл
						
						НСтрока.ТНВЭДНоменклатуры = Справочники.ТНВЭД.НайтиПоКоду(СокрЛП(Стр["Номер_2"]));
						
						Если ТипЗнч(Стр["Номер_6"]) = Тип("Число") Тогда
							НСтрока.ТаможеннаяСтоимость = НСтрока.Количество * Стр["Номер_6"];
						Иначе
							НСтрока.ТаможеннаяСтоимость = НСтрока.Количество * Стр["Номер_7"];	
						КонецЕсли;
						
					КонецЦикла;
				
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////////////////////////
	// Удалим пустые строки в ТЗ ДанныеГТДУпаковки
	/////////////////////////////////////////////////////////////////////////////////////////////
	
	СтрокиДляУдаления = Новый Массив;

	Для Каждого СтрокаТЧ Из ДанныеГТДУпаковки Цикл
	
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТНВЭДНоменклатуры) И НЕ ЗначениеЗаполнено(СтрокаТЧ.Количество) Тогда
			СтрокиДляУдаления.Добавить(СтрокаТЧ);
		КонецЕсли;
	
	КонецЦикла;

	Для Каждого СтрокаТЧ Из СтрокиДляУдаления Цикл
		ДанныеГТДУпаковки.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	/////////////////////////////////////////////////////////////////////////////////////////////
	// Удалим временные файлы
	/////////////////////////////////////////////////////////////////////////////////////////////
	
	Попытка
   		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
   		ЗаписьЖурналаРегистрации(НСтр("ru = 'Удаление временного файла'"), УровеньЖурналаРегистрации.Предупреждение, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат ДанныеГТДУпаковки;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуЗначений(ИсточникДанных) Экспорт
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ИсточникДанных);
	ПостроительЗапроса.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	ПостроительЗапроса.ЗаполнитьНастройки();
	ПостроительЗапроса.Выполнить();
			
	Возврат ПостроительЗапроса.Результат.Выгрузить();
	
КонецФункции

&НаСервере
Функция ПрочитатьТабличныйДокументВТаблицуЗначений(ИсточникДанных) Экспорт
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ИсточникДанных);
	ПостроительЗапроса.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	ПостроительЗапроса.Выполнить();
	
	ТЗРезультат = ПостроительЗапроса.Результат.Выгрузить();
	
	КоличествоСтолбцов = ТЗРезультат.Колонки.Количество()-1;
	
	Если КоличествоСтолбцов = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Для НомерСтолбца = 0 По КоличествоСтолбцов Цикл
		ТЗРезультат.Колонки[НомерСтолбца].Имя = "Номер_" + Формат(НомерСтолбца,"ЧГ=0");
		ТЗРезультат.Колонки[НомерСтолбца].Заголовок = "Номер_" + Формат(НомерСтолбца,"ЧГ=0");
	КонецЦикла;
	
	Возврат ТЗРезультат;
	
КонецФункции

#КонецОбласти
